app/controllers/admins_controller.rb

  def show
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    @admin = Admin.new(admin_params)
      if @admin.save
---
INSERT INTO "admins" ("codigo", "created_at", "updated_at") VALUES (?, ?, ?)  [["codigo", "22323324324"], ["created_at", "2018-11-08 02:03:15.384774"], ["updated_at", "2018-11-08 02:03:15.384774"]]