app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."codigo" = ? LIMIT ?  [["codigo", "asd"], ["LIMIT", 1]]
---
  def create
    admin = Admin.find_by(codigo: params[:session][:codigo])