app/controllers/static_pages_controller.rb

	def home
		@r = Residence.all.sample
---
SELECT  "residences".* FROM "residences" ORDER BY "residences"."id" DESC LIMIT ?  [["LIMIT", 1]]